In [10]:
import pandas as pd
import numpy as np

In [11]:
ca = pd.read_csv('data/car-assignments.csv')
ca.head()

   LastName FirstName  CarID   CurrentEmploymentType CurrentEmploymentTitle
0   Calixto      Nils    1.0  Information Technology            IT Helpdesk
1     Azada      Lars    2.0             Engineering               Engineer
2     Balas     Felix    3.0             Engineering               Engineer
3  Barranco    Ingrid    4.0               Executive                SVP/CFO
4      Baza      Isak    5.0  Information Technology          IT Technician

In [12]:
gps = pd.read_csv('data/gps.csv')
gps.head()

             Timestamp  id        lat       long
0  01/06/2014 06:28:01  35  36.076225  24.874689
1  01/06/2014 06:28:01  35  36.076220  24.874596
2  01/06/2014 06:28:03  35  36.076211  24.874443
3  01/06/2014 06:28:05  35  36.076217  24.874253
4  01/06/2014 06:28:06  35  36.076214  24.874167

In [13]:
ca['CarID'].unique()

array([ 1.,  2.,  3.,  4.,  5.,  6.,  7.,  8.,  9., 10., 11., 12., 13.,
       14., 15., 16., 17., 18., 19., 20., 21., 22., 23., 24., 25., 26.,
       27., 28., 29., 30., 31., 32., 33., 34., 35., nan])